GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17556.inc
;-----Bank62------------------
IOCWP            EQU  H'1ECD'
IOCWN            EQU  H'1ECE'
IOCWF            EQU  H'1ECF'
RB1I2C           EQU  H'1EE3'
RB2I2C           EQU  H'1EE4'
RC3I2C           EQU  H'1EEB'
RC4I2C           EQU  H'1EEC'
UMTOAP           EQU  H'1F0C'
UMTOAL           EQU  H'1F0D'
UMTOAH           EQU  H'1F0E'
PORTW            EQU  H'1F22'
LATW             EQU  H'1F23'
PORTWIN0         EQU  H'1F24'
PORTWIN1         EQU  H'1F25'
PORTWIN2         EQU  H'1F26'
PORTWIN3         EQU  H'1F27'
PORTWIN4         EQU  H'1F28'
PORTWIN5         EQU  H'1F29'
PORTWIN6         EQU  H'1F2A'
PORTWIN7         EQU  H'1F2B'
PORTWCLK         EQU  H'1F2C'
PORTWDF          EQU  H'1F2D'
PORTWCON         EQU  H'1F2E'

;-----Bank63------------------
APMCON           EQU  H'1F4C'
APMPRE           EQU  H'1F4D'
APMPREL          EQU  H'1F4D'
APMPREH          EQU  H'1F4E'
APMPER           EQU  H'1F4F'
APMPERL          EQU  H'1F4F'
APMPERH          EQU  H'1F50'
APMSTART1        EQU  H'1F51'
APMSTART1L       EQU  H'1F51'
APMSTART1H       EQU  H'1F52'
APMPERS1         EQU  H'1F53'
APMPERS1L        EQU  H'1F53'
APMPERS1H        EQU  H'1F54'
APMPERS1U        EQU  H'1F55'
APMSTART2        EQU  H'1F56'
APMSTART2L       EQU  H'1F56'
APMSTART2H       EQU  H'1F57'
APMSTART2U       EQU  H'1F58'
APMPERS2         EQU  H'1F59'
APMPERS2L        EQU  H'1F59'
APMPERS2H        EQU  H'1F5A'
APMPERS2U        EQU  H'1F5B'
APMEND1          EQU  H'1F5C'
APMEND1L         EQU  H'1F5C'
APMEND1H         EQU  H'1F5D'
APMEND1U         EQU  H'1F5E'
APMPERE1         EQU  H'1F5F'
APMPERE1L        EQU  H'1F5F'
APMPERE1H        EQU  H'1F60'
APMPERE1U        EQU  H'1F61'
APMEND2          EQU  H'1F62'
APMEND2L         EQU  H'1F62'
APMEND2H         EQU  H'1F63'
APMEND2U         EQU  H'1F64'
APMPERE2         EQU  H'1F65'
APMPERE2L        EQU  H'1F65'
APMPERE2H        EQU  H'1F66'
APMPERE2U        EQU  H'1F67'
APMCLK           EQU  H'1F68'
APMSTATUS        EQU  H'1F69'
APMSTATUSL       EQU  H'1F69'
APMSTATUSH       EQU  H'1F6A'
APMSTATUSU       EQU  H'1F6B'

;-----Bank64------------------
STATUS_SHAD      EQU  H'1FE4'
WREG_SHAD        EQU  H'1FE5'
BSR_SHAD         EQU  H'1FE6'
PCLATH_SHAD      EQU  H'1FE7'
FSR0_SHAD        EQU  H'1FE8'
FSR0L_SHAD       EQU  H'1FE8'
FSR0H_SHAD       EQU  H'1FE9'
FSR1_SHAD        EQU  H'1FEA'
FSR1L_SHAD       EQU  H'1FEA'
FSR1H_SHAD       EQU  H'1FEB'
STKPTR           EQU  H'1FED'
TOSL             EQU  H'1FEE'
TOSH             EQU  H'1FEF'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NPD              EQU  H'0003'
NTO              EQU  H'0004'
CARRY            EQU  H'0000'
ZERO             EQU  H'0002'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'
BSR5             EQU  H'0005'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- TRISE Bits -----------------------------------------------------
TRISE3           EQU  H'0003'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


